app/controllers/articles_controller.rb

  def index
    @articles=Article.includes(:user).order('created_at DESC').page(params[:page]).per(5)
---
SELECT  `articles`.* FROM `articles`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (6, 5, 2)